app/controllers/events_controller.rb

INSERT INTO "events" ("arrival_time", "created_at", "departure_time", "duration", "end_location", "phone_number", "start_location", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new
    @event.start_location = params[:start_location].to_s
    @event.end_location = params[:end_location].to_s
    @event.arrival_time = DateTime.parse(params[:arrival_time])
    # @event.duration = @event.get_travel_time
    # @event.departure_time = @event.arrival_time - @event.get_travel_time
    @event.phone_number = params[:phone_number]

    if @event.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "duration" = ?, "start_location" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["duration", 206], ["start_location", "225 N. Michigan Ave, Chicago"], ["updated_at", "2014-08-04 20:37:18.084011"]]
---
  def update
    @event = Event.find(params[:id])

    @event.start_location = params[:start_location]
    @event.end_location = params[:end_location]
    @event.arrival_time = DateTime.parse(params[:arrival_time])
    # @event.departure_time = params[:departure_time]
    # @event.duration = params[:duration]
    @event.phone_number = params[:phone_number]

    if @event.save